
#Правила проектування
dim_sr = [100]                      #порізка кратно, мм
energy = [80, 100]                  #ефективність опори, %
sylomer_type = [28,42,55,110]       #перечень SR для підбору
# 313 = [18, 28, 42, 55,110,220,850,1200]

bh =[100, 400]                      #дистанція між опорами
numbers=99                          #максимальна кількість опор


price = {18:155.93, 28:183.77, 42:215.33, 55:258.02, 110:178.2,\
         220:415.8, 850:714.66, 1200:770.35} #ціни на матеріали в євро/м2

from Start import start2
start2(dim_sr,bh,energy,sylomer_type,\
    numbers, price)
